planning.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Planning</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a>
</div>
<div id="content">
<h1 class="title">Planning</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Definition of a classical planning problem</a></li>
<li><a href="#sec-2">Typical assumptions</a></li>
<li><a href="#sec-3">Generic planning algorithm</a></li>
<li><a href="#sec-4">The frame problem</a></li>
<li><a href="#sec-5">Limitations of classical planning</a></li>
</ul>
</div>
</div>
<p>
Planning is another search problem, but it is slightly different than
8-puzzle, chess, etc. In a planning problem, we typically do not
completely describe a state. Rather, we give just partial
descriptions, like <code>on(monkey, floor), at(monkey, 5, 2)</code>. There might
be lots of other things in the room besides the monkey, but we don't
want to describe all those other facts. Breadth-first search,
depth-first search, A*, etc. would have trouble with these kinds of
states because they are incomplete.
</p>

<p>
But we can handle these states by treating it as a planning
problem. The way the planning algorithm works, and the way we describe
planning problems, is slightly different because we want to know how
different actions add or remove facts from the state; the action does
not describe all the facts of the state that will result.
</p>

<p>
Here is an example (from your book) to illustrate the problem
BFS/DFS/A* would face. Suppose we have 10 airports, 50 planes, and 200
pieces of cargo. All the cargo is at SFO and needs to be at
JFK. Planes are assumed to have infinite capacity. There are three
actions: load cargo, unload cargo, and fly the plane from one airport
to another. Suppose each of the 50 planes can fly to 9 other
airports, and that each of the 200 packages can be loaded on any
plane. Then we have 9*50*50*200 possible actions at the start; that's
4.5 million possible actions.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Definition of a classical planning problem</h2>
<div class="outline-text-2" id="text-1">
<dl class="org-dl">
<dt> Initial state </dt><dd>a conjunction of positive "literals" (no variables), e.g.,
<code>on(monkey, floor), at(monkey, 5, 2), at(box, 3,
                   0), on(bananas, box)</code>
</dd>

<dt> Actions </dt><dd>a set of possible actions to take. Each action has an
action name, <b>relevant variables</b>, <b>preconditions</b>, and
<b>effects</b>. Think of an action like a function with
arguments. The preconditions say under what conditions
the action is valid; they can refer to the arguments. The
effects say what the result of the action is; they can
also refer to the arguments, and can include positive and
negative effects, sometimes separated as "add" effects
and "delete" effects.
</dd>

<dt> Goal state </dt><dd>another conjunction of literals. Both positive and
negative literals are allowed. E.g., <code>on(monkey, box),
                not(on(bananas, box))</code>.
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Typical assumptions</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Atomic time: Each action is indivisible 
</li>

<li>No concurrent actions are allowed (though actions do not need to be
ordered with respect to each other in the plan)
</li>

<li>Deterministic actions: The result of actions are completely
determined—there is no uncertainty in their effects
</li>

<li>Agent is the sole cause of change in the world 
</li>

<li>Agent is omniscient: Has complete knowledge of the state of the
world
</li>

<li>Closed World Assumption: everything known to be true in the world is
included in the state description. Anything not listed is false.
</li>
</ul>

<p>
(From: <a href="http://people.cs.pitt.edu/~litman/courses/cs2710/lectures/ch10RNa.pdf">http://people.cs.pitt.edu/~litman/courses/cs2710/lectures/ch10RNa.pdf</a>)
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Generic planning algorithm</h2>
<div class="outline-text-2" id="text-3">
<p>
Forward search, like breadth-first or depth-first search, would try
any action that met the preconditions, and see what
resulted. Eventually, it would find a state that met the goal
criteria. This is a bit slow, however, since BFS and DFS are not
considering <b>relevant</b> actions.
</p>

<p>
It is better to work backwards from the goal. Find out first which
action would put you in the goal state, then figure out which action
is required to meet its preconditions. Go backwards like this until
the preconditions for some action are already met by the starting
state.
</p>

<p>
Suppose you want to find actions relevant to the state \(g\). Then a
relevant action is one where some of the effects of the action are
elements of \(g\). For example, suppose we want <code>on(monkey, box)</code> and
some action like <code>climb(X, Y)</code> has as the effect we are looking for if
<code>X=monkey</code> and <code>Y=box</code>. Then this action would be relevant. We would
look at its preconditions, and meeting those would be the new
goal. Thus, we build the plan backwards, so the final plan needs to be
reversed before we can actually follow it in the real world. (Note, we
also have to be careful that no part of the effects of an action
cancel out some part of our goal.)
</p>

<pre class="example">
function find-plan(state, goal):

  # goal not found
  if(initial-state does not meet goal):

    relevant-actions &lt;- Find actions that include part
                        of the goal in their effects

    foreach(relevant-action):

      if(state meets preconditions-of-action):

        # our plan is simply this action itself
        return action

      else:

        # try to find a plan to achieve this action's preconditions
        partial-plan &lt;- find-plan(state, preconditions-of-action)

        if(partial-plan is found):

          # we can achieve this action's preconditions; so the new plan
          # is the partial-plan plus this action itself
          return (action + partial-plan)

  # no action was relevant or its preconditions could not be met,
  # or we are already at the goal, so return no-plan
  return no-plan
</pre>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">The frame problem</h2>
<div class="outline-text-2" id="text-4">
<p>
Our actions indicate what effects the actions have, e.g., the "climb"
action in which the monkey climbs on the box results in the monkey
being on the box. But our actions normally do not state all the facts
of the world that don't change. But then how can be sure what exactly
changed and what didn't? Did the box move as the monkey tried to climb
it? How can we be sure? And if we wanted to, how could we list all the
things that do and don't change? This might not matter in a toy
problem, but in the real world it matters a lot.
</p>

<blockquote>
<p>
The analogy of the stage magician is particularly apt. One is not
likely to make much progress in figuring out <i>how</i> the tricks are done
by simply sitting attentively in the audience and watching like a
hawk. Too much is going on out of sight. Better to face the fact that
one must either rummage around backstage or in the wings, hoping to
disrupt the performance in telling ways; or, from one's armchair,
think aphoristically about how the tricks <i>must</i> be done, given
whatever is manifest about the constraints. The frame problem is then
rather like the unsettling but familiar 'discovery' that so far as
armchair thought can determine, a certain trick we have just observed
is flat impossible.
&#x2014; <a href="http://web.fc.uaem.mx:8080/~bruno/material/dennet_93_cognitiveWheels.pdf">"Cognitive Wheels: The frame problem of AI," Daniel C. Dennett</a>
</p>
</blockquote>

<blockquote>
<p>
The frame problem is not the problem of induction in disguise. For
suppose the problem of induction were solved. Suppose&#x2014;perhaps
miraculously&#x2014;that our agent has solved all its induction problems or
had them solved by fiat; it believes, then, all the right
generalizations from its evidence, and associates with all of them the
appropriate probabilities and conditional probabilities. This agent,
<i>ex hypothesi</i>, believes just what it ought to believe about all
empirical matters in its ken, including the probabilities of future
events. It might still have a bad case of the frame problem, for that
problem concerns how to represent (so it can be <i>used</i>) all that
hard-won empirical information&#x2014;a problem that arises independently of
the truth value, probability, warranted assertability, or subjective
certainty of any of it. Even if you have excellent <i>knowledge</i> (and
not mere belief) about the changing world, how can this knowledge be
represented so that it can be efficaciously brought to bear?
&#x2014; <a href="http://web.fc.uaem.mx:8080/~bruno/material/dennet_93_cognitiveWheels.pdf">"Cognitive Wheels: The frame problem of AI," Daniel C. Dennett</a>
</p>
</blockquote>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Limitations of classical planning</h2>
<div class="outline-text-2" id="text-5">
<p>
Classical planning considers what to do in what order, but
not&#x2026;
</p>

<ul class="org-ul">
<li>When actions happen and how long they take.
</li>
<li>Limited resources that actions may need.
</li>
<li>Semi-observable environments.
</li>
<li>Dynamic environments.
</li>
<li>Uncertain environments.
</li>
<li>Stochastic (partially random) environments.
</li>
</ul>

<div style="font-size: 80%; clear: both;"> <span
xmlns:dct="http://purl.org/dc/terms/"
href="http://purl.org/dc/dcmitype/Text" property="dct:title"
rel="dct:type">Intro to AI material</span> by <a
xmlns:cc="http://creativecommons.org/ns#"
href="http://cse3521.artifice.cc" property="cc:attributionName"
rel="cc:attributionURL">Joshua Eckroth</a> is licensed under a <a
rel="license"
href="http://creativecommons.org/licenses/by-sa/3.0/">Creative Commons
Attribution-ShareAlike 3.0 Unported License</a>. Source code for this
website available at <a
href="https://github.com/joshuaeckroth/cse3521-website">GitHub</a>.
</div>

<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','http://www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-23971505-3', 'artifice.cc');
  ga('send', 'pageview');

</script>

<script src="http://code.jquery.com/jquery-1.9.1.js"></script>
<script src="http://code.jquery.com/ui/1.10.3/jquery-ui.js"></script>

<script type="text/javascript">
$('.hidden .hidden-content').hide();
$('.hidden > strong').click(function() {
  $(this).parent().find('.hidden-content').toggle();
});
</script>
</div>
</div>
</div>
</body>
</html>
